import { OutcomeItem } from "./class1_outcomes";

export const CLASS_4_OUTCOMES: Record<string, OutcomeItem[]> = {
  "marathi": [
    {
      "id": "c4_ma_1",
      "code": "C-1.1.1",
      "text": "घटना, प्रसंग, गोष्ट, गाणी, कविता अथवा दैनंदिन अनुभव इत्यादिबाबत सहाध्यायांशी संभाषण करतो."
    },
    {
      "id": "c4_ma_2",
      "code": "C-1.1.2",
      "text": "कथा, उतारा, परिच्छेद, बातमी ऐकून त्यांबाबत गटचर्चा करतो."
    },
    {
      "id": "c4_ma_3",
      "code": "C-1.1.3",
      "text": "घडलेल्या घटना, प्रसंग व दैनंदिन अनुभव यांबाबत सुसंगतपणे मत व्यक्त करतो."
    },
    {
      "id": "c4_ma_4",
      "code": "C-1.2.2",
      "text": "मजकुरातील मूळ कल्पना सविस्तरपणे सांगतो."
    },
    {
      "id": "c4_ma_5",
      "code": "C-1.2.3",
      "text": "साहित्यातील आशयाचे वर्णन करतो."
    },
    {
      "id": "c4_ma_6",
      "code": "C-1.2.4",
      "text": "वर्गातील वाचलेल्या साहित्यातील मजकुराचा सारांश सांगतो."
    },
    {
      "id": "c4_ma_7",
      "code": "C-1.3.2",
      "text": "सण, उत्सव, दिनविशेष यांप्रसंगी शुभेच्छा देतो व माहिती सांगतो."
    },
    {
      "id": "c4_ma_8",
      "code": "C-1.3.3",
      "text": "शाळेतील विविध कार्यक्रमांत मौखिक सादरीकरण करतो."
    },
    {
      "id": "c4_ma_9",
      "code": "C-2.1.1",
      "text": "वाचलेल्या मजकुरातील (गद्य व पद्य) घटनांचा योग्य क्रम सांगतो."
    },
    {
      "id": "c4_ma_10",
      "code": "C-2.1.3",
      "text": "विविध प्रकारांच्या मजकुरांचे विरामचिन्हांसह (पूर्णविराम, स्वल्पविराम, प्रश्नचिन्ह, एकेरी/दुहेरी अवतरण, उद्‌गारवाचक चिन्ह) वाचन करतो."
    },
    {
      "id": "c4_ma_11",
      "code": "C-2.1.4",
      "text": "वाचलेल्या मजकुरातील आशयासंबंधी अंदाज बांधतो व स्वभाषेत सांगतो."
    },
    {
      "id": "c4_ma_12",
      "code": "C-2.2.3",
      "text": "वाचलेल्या साहित्यातील (गद्य/पद्य) आशय, निष्कर्ष सांगतो."
    },
    {
      "id": "c4_ma_13",
      "code": "C-3.1.1",
      "text": "दिलेल्या शब्दसमूहांपासून सुसंगत वाक्य तयार करून लिहितो."
    },
    {
      "id": "c4_ma_14",
      "code": "C-3.1.2",
      "text": "परिसरात पडलेल्या घटनांचा क्रम लावून स्वानुभवावर आधारित परिच्छेद तयार करतो, स्व-मतासह समारोप करतो."
    },
    {
      "id": "c4_ma_15",
      "code": "C-3.1.3",
      "text": "अपरिचित मजकुराचे वाचन करून शीर्षक लिहितो."
    },
    {
      "id": "c4_ma_16",
      "code": "C-3.1.4",
      "text": "विविध साहित्यप्रकारांत स्वतःच्या अनुभवांची 4 ते 5 वाक्यांत मांडणी करून समर्पक शीर्षक देतो."
    },
    {
      "id": "c4_ma_17",
      "code": "C-3.2.2",
      "text": "दिलेल्या मजकुरातील प्रसंगावर आधारित स्व-मत लिहितो."
    },
    {
      "id": "c4_ma_18",
      "code": "C-3.3.3",
      "text": "शालेय सांस्कृतिक कार्यक्रमाची निमंत्रणपत्रिका तयार करतो."
    },
    {
      "id": "c4_ma_19",
      "code": "C-3.3.4",
      "text": "स्वतःच्या अनुभवाचे संवाद रूपात लेखन करतो."
    },
    {
      "id": "c4_ma_20",
      "code": "C-3.4.1",
      "text": "योग्य विरामचिन्हे (पूर्णविराम, स्वल्पविराम, अल्पविराम, प्रश्नचिन्ह, उद्‌गारवाचक चिन्हे, एकेरी व दुहेरी अवतरण चिन्हे) व जोडाक्षरयुक्त शब्द यांचा वापर करून पाच ते सहा आळीत मजकूर लिहितो."
    },
    {
      "id": "c4_ma_21",
      "code": "C-3.4.2",
      "text": "लेखनांचे नियम विचारात घेऊन शब्दरचना व वाक्यरचना करतो."
    },
    {
      "id": "c4_ma_22",
      "code": "C-3.4.3",
      "text": "विशेषण, क्रियापद, काळ यांचा विचार करून मजकुरांचे लेखन करतो."
    },
    {
      "id": "c4_ma_23",
      "code": "C-4.1.1",
      "text": "समानार्थी, विरुद्धार्थी शब्दांची यादी तयार करतो."
    },
    {
      "id": "c4_ma_24",
      "code": "C-4.1.2",
      "text": "अनेक अर्थ असलेल्या शब्दांचा संग्रह करतो."
    },
    {
      "id": "c4_ma_25",
      "code": "C-4.1.3",
      "text": "शब्दांचा अर्थ समजून घेऊन त्यांचा व्यावहारिक उपयोग करतो."
    },
    {
      "id": "c4_ma_26",
      "code": "C-4.2.1",
      "text": "प्रत्यक्ष कृतीद्वारे शब्दचित्रे व शब्दखेळांच्या माध्यमातून नवनवीन शब्द संकलित करतो."
    },
    {
      "id": "c4_ma_27",
      "code": "C-4.2.2",
      "text": "एका शब्दाच्या पर्यायी इतर शब्दांचा वापर करून वाक्यलेखन करतो."
    },
    {
      "id": "c4_ma_28",
      "code": "C-4.2.3",
      "text": "भाषिक खेळाच्या माध्यमातून अधिकाधिक शब्दसंग्रह करतो."
    },
    {
      "id": "c4_ma_29",
      "code": "C-4.2.4",
      "text": "पूरक वाचन साहित्यातून भाषिक खेळाद्वारे नावीन्यपूर्ण शब्दांचा संग्रह वाढवतो."
    },
    {
      "id": "c4_ma_30",
      "code": "C-4.2.5",
      "text": "शब्दकोडे सोडवतो."
    },
    {
      "id": "c4_ma_31",
      "code": "C-4.3.1",
      "text": "वाचलेल्या लोकसाहित्यातील अपरिचित शब्दांची यादी करतो."
    },
    {
      "id": "c4_ma_32",
      "code": "C-4.3.2",
      "text": "अभंगातील अपरिचित शब्दांचे अर्थ शालेय शब्दकोशातून शोधतो."
    },
    {
      "id": "c4_ma_33",
      "code": "C-4.3.3",
      "text": "लोकसाहित्य वाचून अपरिचित शब्द शोधतो व शब्दसंग्रह वाढवतो."
    },
    {
      "id": "c4_ma_34",
      "code": "C-4.3.4",
      "text": "वाचलेले लोकसाहित्य स्वतःच्या भाषेत सांगतो."
    },
    {
      "id": "c4_ma_35",
      "code": "C-5.1.1",
      "text": "ग्रंथालयातील विविध पुस्तकांची ओळख करून घेतो."
    },
    {
      "id": "c4_ma_36",
      "code": "C-5.1.2",
      "text": "ग्रंथालयातील पुस्तके वाचनसाहित्य स्वतः हाताळून त्यांचे प्रकाशनांनुसार वर्गीकरण करतो."
    },
    {
      "id": "c4_ma_37",
      "code": "C-5.1.3",
      "text": "शालेय ग्रंथालयातून पूरक व संदर्भ पुस्तकांची नियमितपणे देवघेव करतो."
    },
    {
      "id": "c4_ma_38",
      "code": "C-5.2.1",
      "text": "ग्रंथालयातील पुस्तकांचे वाचन करून त्यातील आवडलेला भाग सांगतो."
    },
    {
      "id": "c4_ma_39",
      "code": "C-5.2.2",
      "text": "पालकांच्या व शिक्षकांच्या मदतीने ई-लायब्ररीचा वापर करतो."
    },
    {
      "id": "c4_ma_40",
      "code": "C-5.3.1",
      "text": "वर्तमानपत्रातील विविध बातम्यांचे मथळे/शीर्षक वाचतो."
    },
    {
      "id": "c4_ma_41",
      "code": "C-5.3.2",
      "text": "वाचलेल्या बातमीच्या आधारे विचारलेल्या प्रश्नांची उत्तरे देतो."
    },
    {
      "id": "c4_ma_42",
      "code": "C-5.3.3",
      "text": "मित्तिफलकावर बातम्यांची कात्रणे प्रदर्शित करतो."
    }
  ],
  "math": [
    {
      "id": "c4_ma_1",
      "code": "C-1.1.1",
      "text": "हजार ही संकल्पना समजून हजाराची मांडणी विविध रूपांत करतो."
    },
    {
      "id": "c4_ma_2",
      "code": "C-1.1.2",
      "text": "9999 पर्यंतच्या संख्या ओळखतो. अंकात व अक्षरांत लिहितो."
    },
    {
      "id": "c4_ma_3",
      "code": "C-1.1.3",
      "text": "संख्येतील अंकाची दर्शनी किंमत व स्थानिक किंमत सांगतो."
    },
    {
      "id": "c4_ma_4",
      "code": "C-1.1.4",
      "text": "संख्याची तुलना करतो."
    },
    {
      "id": "c4_ma_5",
      "code": "C-1.1.5",
      "text": "सूचनेनुसार संख्या तयार करतो व चढता उतरता क्रम लावतो."
    },
    {
      "id": "c4_ma_6",
      "code": "C-1.1.6",
      "text": "शून्य या अंकाच्या किमतीबाबत / वापराबाबत / उत्सुकता / जागरूकरता दर्शवतो."
    },
    {
      "id": "c4_ma_7",
      "code": "C-1.1.7",
      "text": "सम संख्या आणि विषम संख्या यांमध्ये फरक सांगतो, वर्गीकरण करतो."
    },
    {
      "id": "c4_ma_8",
      "code": "C-1.2.1",
      "text": "सुचवलेल्या अपूर्णांकाच्या भागानुसार त्याचा पूर्ण भाग ओळखतो, काढून दाखवतो."
    },
    {
      "id": "c4_ma_9",
      "code": "C-1.2.2",
      "text": "पूर्णांकयुक्त अपूर्णांक स्पष्ट करतो. दैनंदिन जीवनात पूर्णांकयुक्त अपूर्णांकाचा वापर करतो."
    },
    {
      "id": "c4_ma_10",
      "code": "C-1.2.3",
      "text": "पूर्णांकयुक्त अपूर्णांकाचे लेखन करतो."
    },
    {
      "id": "c4_ma_11",
      "code": "C-1.2.4",
      "text": "पूणांकयुक्त अपूर्णांकाची चित्ररूपात मांडणी करतो."
    },
    {
      "id": "c4_ma_12",
      "code": "C-1.2.5",
      "text": "चित्र, वस्तू व संख्या रूपांतील अपूर्णांकाची तुलना करतो."
    },
    {
      "id": "c4_ma_13",
      "code": "C-1.3.1",
      "text": "बेरीज-वजाबाकी उदाहरणे तयार करतो. मांडणी करून सोडवतो. (उत्तर 9999 पर्यंत अपेक्षित)"
    },
    {
      "id": "c4_ma_14",
      "code": "C-1.3.2",
      "text": "किमान 100 पर्यंतचे संख्याबंध करतो."
    },
    {
      "id": "c4_ma_15",
      "code": "C-1.3.3",
      "text": "9999 रूपये रकमेपर्यंतचे व्यवहार करतो."
    },
    {
      "id": "c4_ma_16",
      "code": "C-1.3.4",
      "text": "गुणाकाराची उदाहरणे सोडवितो व तयार करतो. (तीन अंकापर्यंतच्या संख्येस दोन अंकापर्यंतच्या संख्येने गुणणे.)"
    },
    {
      "id": "c4_ma_17",
      "code": "C-1.3.5",
      "text": "भागाकाराची उदाहरणे सोडवितो व तयार करतो. (तीन अंकापर्यंतच्या संख्येस दोन अंकी संख्येने भागणे.)"
    },
    {
      "id": "c4_ma_18",
      "code": "C-1.3.6",
      "text": "भाज्य, भाजक भागाकार व बाकी या संकल्पना स्पष्ट करतो."
    },
    {
      "id": "c4_ma_19",
      "code": "C-1.3.7",
      "text": "मिश्र क्रियांची उदाहरणे सोडवितो."
    },
    {
      "id": "c4_ma_20",
      "code": "C-1.4.1",
      "text": "सम आणि विषम संख्या ओळखतो."
    },
    {
      "id": "c4_ma_21",
      "code": "C-1.4.2",
      "text": "सम-विषम संख्यांच्या आधारे आकृतिबंध तयार करतो विस्तार करतो."
    },
    {
      "id": "c4_ma_22",
      "code": "C-2.1.1",
      "text": "परिसरातील विविध कोन ओळखतो."
    },
    {
      "id": "c4_ma_23",
      "code": "C-2.1.2",
      "text": "दिलेल्या कोनांचे काटकोन, लघुकोन, विशालकोन असे वर्गीकरण करतो."
    },
    {
      "id": "c4_ma_24",
      "code": "C-2.1.3",
      "text": "द्विमितीय व त्रिमितीय आकारांची तुलना करतो."
    },
    {
      "id": "c4_ma_25",
      "code": "C-2.1.4",
      "text": "द्विमितीय व त्रिमितीय आकारांचा संबोध स्पष्ट करतो."
    },
    {
      "id": "c4_ma_26",
      "code": "C-2.1.5",
      "text": "द्विमितीय व त्रिमितीय आकारांमध्ये सहसंबंध प्रस्थापित करतो."
    },
    {
      "id": "c4_ma_27",
      "code": "C-2.1.6",
      "text": "विविध चिती व सूची ओळखतो. कडा, कोपरे व पृष्ठभाग मोजतो."
    },
    {
      "id": "c4_ma_28",
      "code": "C-2.1.7",
      "text": "विशिष्ट द्विमितीय आकार ओळखताना गुणधर्माची कारणमीमांसा देतो."
    },
    {
      "id": "c4_ma_29",
      "code": "C-2.1.8",
      "text": "द्विमितीय आकारात लपलेले इतर द्विमितीय आकार शोधतो सहसंबंध प्रस्थापित करतो."
    },
    {
      "id": "c4_ma_30",
      "code": "C-2.1.9",
      "text": "पेन्सिलीच्या साहाय्याने मुक्त हस्ते द्विमितीय आकार काढण्याचे कौशल्य संपादन करतो."
    },
    {
      "id": "c4_ma_31",
      "code": "C-2.1.10",
      "text": "मुक्त वर्तुळ काढतो. साधनांच्या साहाय्याने वर्तुळ काढण्याचे कौशल्य संपादन करतो."
    },
    {
      "id": "c4_ma_32",
      "code": "C-2.1.11",
      "text": "वर्तुळाकाराचा अंदाज बांधतो."
    },
    {
      "id": "c4_ma_33",
      "code": "C-2.2.1",
      "text": "परिसरातील त्रिमितीय वस्तूचे वरून दृश्य, बाजूचे दृश्य, समोरील दृश्य ओळखतो."
    },
    {
      "id": "c4_ma_34",
      "code": "C-2.2.2",
      "text": "सार्वजनिक ठिकाणी जाण्यासाठी आधारित योग्य सूचना तयार करतो."
    },
    {
      "id": "c4_ma_35",
      "code": "C-2.2.3",
      "text": "एखादया सार्वजनिक ठिकाणचा नकाशा पाहून रचना योग्य की अयोग्य यावर चर्चा करतो."
    },
    {
      "id": "c4_ma_36",
      "code": "C-2.2.4",
      "text": "परिचित ठिकाणांचा नजरी नकाशा तयार करतो."
    },
    {
      "id": "c4_ma_37",
      "code": "C-2.2.5",
      "text": "संदर्भानुसार दिलेल्या सूचनेप्रमाणे वस्तू अचूक जागी ठेवतो."
    },
    {
      "id": "c4_ma_38",
      "code": "C-2.3.1",
      "text": "विविध त्रिमितीय आकारातील सममिती ओळखतो."
    },
    {
      "id": "c4_ma_39",
      "code": "C-2.3.2",
      "text": "आरशातील प्रतिबिंबाच्या साहाय्याने परावर्तित सममिती ओळखतो/काढतो."
    },
    {
      "id": "c4_ma_40",
      "code": "C-2.4.1",
      "text": "त्रिमितीय आकारातील आकृतिबंध ओळखतो."
    },
    {
      "id": "c4_ma_41",
      "code": "C-2.4.2",
      "text": "वस्तूच्या व चित्रांच्या मदतीने विस्तारत जाणारा आकृतिबंधाचा नमुना तयार करतो."
    },
    {
      "id": "c4_ma_42",
      "code": "C-2.4.3",
      "text": "विविध आकारांच्या मदतीने स्वतःचे आकृतिबंध तयार करतो."
    },
    {
      "id": "c4_ma_43",
      "code": "C-2.4.4",
      "text": "दिलेल्या क्षेत्रासाठी टाईलिंगचा अंदाज करतो. पडताळा करतो. दिलेल्या क्षेत्रासाठी दोन मिन्न आकारांनी टाईलिंग करतो."
    },
    {
      "id": "c4_ma_44",
      "code": "C-3.1.1",
      "text": "दिलेल्या लांबी मोजण्यासाठी योग्य प्रमाणित एकक व साधन वापरतो."
    },
    {
      "id": "c4_ma_45",
      "code": "C-3.1.2",
      "text": "प्रमाणित एकक धरून लांबी, अंतर यांचा अंदाज बांधतो."
    },
    {
      "id": "c4_ma_46",
      "code": "C-3.1.3",
      "text": "बंदिस्त द्विमितीय आकाराच्या कडांची लांबी मोजतो. (परिमिती मोजतो)"
    },
    {
      "id": "c4_ma_47",
      "code": "C-3.2.1",
      "text": "12 ताशी घडयाळात दर्शवलेली वेळ सांगतो."
    },
    {
      "id": "c4_ma_48",
      "code": "C-3.2.2",
      "text": "दैनंदिन व्यवहारातील वेळेशी संबंधित उदाहरणे सोडवतो. कोडी सोडवतो."
    },
    {
      "id": "c4_ma_49",
      "code": "C-3.2.3",
      "text": "दिलेल्या वस्तूचे वजन करण्यासाठी योग्य प्रमाणित एकके व साधने वापरतो."
    },
    {
      "id": "c4_ma_50",
      "code": "C-3.2.4",
      "text": "ग्रॅम व किलोग्रॅम या एककांतील संबंध पडताळतो."
    },
    {
      "id": "c4_ma_51",
      "code": "C-3.2.5",
      "text": "पाव, अर्घा, पाऊण, सव्वा, दीड किलो इत्यादी व्यवहारातील शब्दांचा योग्य अर्थ लावून एककांचे रूपांतरण करतो."
    },
    {
      "id": "c4_ma_52",
      "code": "C-3.2.6",
      "text": "एकक लांबीचे घन वापरून घन, चौकोनी चिती यांसारख्या आकारांच्या वस्तूंचे आकारमान अनुभवतो."
    },
    {
      "id": "c4_ma_53",
      "code": "C-3.2.7",
      "text": "दिलेल्या द्रव पदार्थाची धारकता मोजण्यासाठी योग्य प्रमाणित एकक व साधन वापरतो."
    },
    {
      "id": "c4_ma_54",
      "code": "C-3.3.1",
      "text": "एकक रूपांतराची गरज ओळखतो."
    },
    {
      "id": "c4_ma_55",
      "code": "C-3.3.2",
      "text": "मापनाच्या एककांचे परस्परांत रूपांतर करतो."
    },
    {
      "id": "c4_ma_56",
      "code": "C-3.3.3",
      "text": "मापनाच्या एककांचे भाग करतो व ते ओळखतो."
    },
    {
      "id": "c4_ma_57",
      "code": "C-3.4.1",
      "text": "क्षेत्र व्यापणे म्हणजे काय? हे ओळखणे."
    },
    {
      "id": "c4_ma_58",
      "code": "C-3.4.2",
      "text": "दिलेल्या आकारास एकक मानून साध्या भौमितिक आकारांचे (आयत, चौरस) क्षेत्रफळ काढतो."
    },
    {
      "id": "c4_ma_59",
      "code": "C-3.4.3",
      "text": "दिलेले क्षेत्र व्यापण्यासाठी किती एकक लागतील यांचा अंदाज करतो पडताळा घेतो."
    },
    {
      "id": "c4_ma_60",
      "code": "C-3.5.1",
      "text": "एखा‌द्या वस्तूची लांबी, दोन ठिकाणातील अंतर इत्यादींचा अंदाज करतो. नंतर प्रत्यक्ष मोजून पडताळा घेतो."
    },
    {
      "id": "c4_ma_61",
      "code": "C-3.5.2",
      "text": "लांबी आधारित वस्तूंचे वर्गीकरण करतो व पडताळा घेतो."
    },
    {
      "id": "c4_ma_62",
      "code": "C-3.5.3",
      "text": "एखाद्या वस्तूच्या वजनाचा अंदाज करुन नंतर प्रत्यक्ष मोजून पडताळा घेतो आणि अंदाज आणि प्रत्यक्ष वजन यांची तुलना करतो."
    },
    {
      "id": "c4_ma_63",
      "code": "C-3.5.4",
      "text": "एखाद्या भांड्यातील द्रवाची धारकता / आकारमान यांचा अंदाज करतो नंतर प्रत्यक्ष मोजून पडताळा घेतो."
    },
    {
      "id": "c4_ma_64",
      "code": "C-3.5.5",
      "text": "आयत, चौरसाची बाजूंची लांबी दिली असता परिमितीचा अंदाज करतो तसेच प्रत्यक्ष मोजून पडताळा करतो."
    },
    {
      "id": "c4_ma_65",
      "code": "C-3.6.1",
      "text": "दिलेल्या आकारांपैकी (आयत व चीरस) समान क्षेत्रफळ असलेल्या आकारांचे वर्गीकरण करतो."
    },
    {
      "id": "c4_ma_66",
      "code": "C-3.6.2",
      "text": "दिलेल्या आकारापैकी समान परिमिती असलेल्या आकारांचे वर्गीकरण करतो क्षेत्रफळ काढतो."
    },
    {
      "id": "c4_ma_67",
      "code": "C-3.6.3",
      "text": "समान परिमिती असलेल्या आकारांचे क्षेत्रफळ वेगवेगळे असते याचा शोध घेतो."
    },
    {
      "id": "c4_ma_68",
      "code": "C-3.7.1",
      "text": "कोणत्याही वस्तूंची लांबी प्रमाणित एककाचा वापर करून सरळ, आडवी. तिरपी धरून मोजतो."
    },
    {
      "id": "c4_ma_69",
      "code": "C-3.7.2",
      "text": "द्रवाच्या प्रमाणित मापनाच्या एककाने द्रवाच्या मापनासंबंधी गुणधर्माचे स्थायीपण तपासतो."
    },
    {
      "id": "c4_ma_70",
      "code": "C-4.1.1",
      "text": "दिलेल्या माहितीचे विश्लेषण करून छोट्या टप्प्यांमध्ये/पायऱ्यांमध्ये विभाजन करतो."
    },
    {
      "id": "c4_ma_71",
      "code": "C-4.1.2",
      "text": "कोडी/कृती/समस्या सोडवण्यासाठी कमीतकमी टप्पे /पायऱ्या शोधतो."
    },
    {
      "id": "c4_ma_72",
      "code": "C-4.1.3",
      "text": "पायऱ्यांच्या साहाय्याने अंतिम उत्तरांपर्यंत निष्कर्षापर्यंत पोहोचतो."
    },
    {
      "id": "c4_ma_73",
      "code": "C-4.1.4",
      "text": "या प्रक्रियेवर आधारित मनोरंजनात्मक कोडी सोडवतो. (उदा मनातील संख्या ओळखणे कोडी/"
    },
    {
      "id": "c4_ma_74",
      "code": "C-4.1.5",
      "text": "स्वतः तशी कोडी बनवतो."
    },
    {
      "id": "c4_ma_75",
      "code": "C-4.2.1",
      "text": "दिलेल्या अटीनुसार रांगोळी/मांडणी/रचना/नकाशे/चित्रे इत्यादी तयार करणे/रंगवणे यांमधील सर्व शक्यता सांगतो."
    },
    {
      "id": "c4_ma_76",
      "code": "C-4.2.2",
      "text": "दिलेले अंक/अक्षरे/रंग इत्यादींची दिलेल्या अटीनुसार पद्धतशीरपणे मोजणी करून सर्व संभाव्य संवेश तयार करतो."
    },
    {
      "id": "c4_ma_77",
      "code": "C-4.2.3",
      "text": "दिलेल्या रंग / फुले / अंक / अक्षरे /वस्तू इत्यादींची सूचनेनुसार रचना/ मांडणी तयार करतो."
    },
    {
      "id": "c4_ma_78",
      "code": "C-43.1",
      "text": "दैनंदिन जीवनातील समस्या सोडविण्यासाठी योग्य त्या क्रिया / पद्धती / साधने निवडतो व निष्कर्ष काढतो."
    },
    {
      "id": "c4_ma_79",
      "code": "C-5.1.1",
      "text": "शून्याच्या विकासात भारतीय गणिततज्ञांच्या योगदानाची प्रसंशा करतो."
    },
    {
      "id": "c4_ma_80",
      "code": "C-5.1.2",
      "text": "भारतीय स्थानिक किंमत आधारित संख्याप्रणालींची इतर संख्याप्रणालीशी तुलना करतो."
    },
    {
      "id": "c4_ma_81",
      "code": "C-5.1.3",
      "text": "भारतात स्थानिक संख्याप्रणालीची वैशिष्टे जाणतो."
    },
    {
      "id": "c4_ma_82",
      "code": "C-6.1.1",
      "text": "वेगवेगळी चित्रे वापरून संकलित माहितीचा तक्ता तयार करतो."
    },
    {
      "id": "c4_ma_83",
      "code": "C-6.1.2",
      "text": "चित्ररूप तक्ता तयार करण्यासाठी प्रमाण म्हणजे काय हे समजून घेतो व अनुमान काढतो."
    },
    {
      "id": "c4_ma_84",
      "code": "C-6.1.3",
      "text": "दिलेल्या प्रमाणानुसार चित्ररूप तक्ता तयार करतो."
    }
  ],
  "english": [
    {
      "id": "c4_en_1",
      "code": "04.02",
      "text": "Highlights and explains the key ideas in a story."
    },
    {
      "id": "c4_en_2",
      "code": "04.03",
      "text": "Spots the main ideas from the conversation."
    },
    {
      "id": "c4_en_3",
      "code": "04.04",
      "text": "Explains a narrated/read out story."
    },
    {
      "id": "c4_en_4",
      "code": "04.05",
      "text": "Recognises and labels the major characters from the narrated/read out stories."
    },
    {
      "id": "c4_en_5",
      "code": "04.06",
      "text": "Discusses about the main ideas/themes and conclusion of the narrated stories."
    },
    {
      "id": "c4_en_6",
      "code": "04.07",
      "text": "Explains key aspects and events from narrated/read out stories."
    },
    {
      "id": "c4_en_7",
      "code": "04.08",
      "text": "Discusses and uses transitional phrases for coherence."
    },
    {
      "id": "c4_en_8",
      "code": "04.09",
      "text": "Participates in conversations by attentive listening."
    },
    {
      "id": "c4_en_9",
      "code": "04.10",
      "text": "Presents orally in the class on the given topics."
    },
    {
      "id": "c4_en_10",
      "code": "04.11",
      "text": "Follows the proper manners of group discussion like attentive listening, active response, respects others opinion, etc."
    },
    {
      "id": "c4_en_11",
      "code": "04.12",
      "text": "Recognises and writes different syllables in the given words."
    },
    {
      "id": "c4_en_12",
      "code": "04.13",
      "text": "Comprehends stress patterns of phrases / sentences."
    },
    {
      "id": "c4_en_13",
      "code": "04.15",
      "text": "Uses basic punctuation marks like capital letters, comma, full stop, etc."
    },
    {
      "id": "c4_en_14",
      "code": "04.16",
      "text": "Finds out difference between sentence structures from the given text."
    },
    {
      "id": "c4_en_15",
      "code": "04.17",
      "text": "Reads age appropriate stories with proper pauses and fluency."
    },
    {
      "id": "c4_en_16",
      "code": "04.18",
      "text": "Explains themes and messages in stories, poems and story posters."
    },
    {
      "id": "c4_en_17",
      "code": "04.19",
      "text": "Picks up books and reads variety of age appropriate library books with comprehension."
    },
    {
      "id": "c4_en_18",
      "code": "04.20",
      "text": "Writes a short paragraph (7-8 lines) to express personal experiences."
    },
    {
      "id": "c4_en_19",
      "code": "04.21",
      "text": "Writes a paragraph to express own experiences on the given topic."
    },
    {
      "id": "c4_en_20",
      "code": "04.22",
      "text": "Prepares a poster by using pictures and phrases."
    },
    {
      "id": "c4_en_21",
      "code": "04.24",
      "text": "Creates instructions for classroom etiquettes."
    },
    {
      "id": "c4_en_22",
      "code": "04.25",
      "text": "Writes imaginary short stories based on experiences."
    },
    {
      "id": "c4_en_23",
      "code": "04.26",
      "text": "Creates short poems based on own imagination and experiences."
    },
    {
      "id": "c4_en_24",
      "code": "04.27",
      "text": "Writes conversations based on own imagination and experiences."
    },
    {
      "id": "c4_en_25",
      "code": "04.28",
      "text": "Listens and guesses the meaning of words and the given context. phrases"
    },
    {
      "id": "c4_en_26",
      "code": "04.29",
      "text": "Finds meaning of words and phrases from the given context."
    },
    {
      "id": "c4_en_27",
      "code": "04.30",
      "text": "Refers a dictionary to find meaning of unfamiliar words."
    },
    {
      "id": "c4_en_28",
      "code": "04.31",
      "text": "Uses various sources like dictionary, encyclopedia  etc. to enlist words related to registers from home environment like 'in my kitchen', 'electrical gadgets', etc."
    }
  ],
  "evs1": [
    {
      "id": "c4_ev_1",
      "code": "C-1.1.1",
      "text": "परिसरातील कीटकांची सामान्य वैशिष्ट्ये सांगतो."
    },
    {
      "id": "c4_ev_2",
      "code": "C-1.1.2",
      "text": "परिसरातील पक्ष्यांची सामान्य वैशिष्ट्ये सांगतो."
    },
    {
      "id": "c4_ev_3",
      "code": "C-1.1.3",
      "text": "परिसरातील वनस्पर्तीची सामान्य वैशिष्ट्ये सांगतो."
    },
    {
      "id": "c4_ev_4",
      "code": "C-1.1.4",
      "text": "परिसरातील प्राण्यांची सामान्य वैशिष्ट्ये सांगतो."
    },
    {
      "id": "c4_ev_5",
      "code": "C-1.1.5",
      "text": "सूर्यमालेतील ग्रहांचा योग्य क्रम सांगतो."
    },
    {
      "id": "c4_ev_6",
      "code": "C-1.1.6",
      "text": "ग्रह आणि तारे यामधील फरक सांगतो."
    },
    {
      "id": "c4_ev_7",
      "code": "C-1.1.7",
      "text": "कृती/खेळू / अभिनय यांच्या साहाय्याने सूर्यमालेतील घटकांची माहिती स्पष्ट करतो."
    },
    {
      "id": "c4_ev_8",
      "code": "C-1.1.8",
      "text": "आपल्या राज्याची भौगोलिक वैशिष्ट्ये सांगतो."
    },
    {
      "id": "c4_ev_9",
      "code": "C-1.2.1",
      "text": "पर्यावरण व मानवी जीवनातील वनस्पतीचे महत्य यावर चर्चा करतो."
    },
    {
      "id": "c4_ev_10",
      "code": "C-1.2.2",
      "text": "पर्यावरण व मानवी जीवनातील प्राण्यांचे महत्व सांगतो."
    },
    {
      "id": "c4_ev_11",
      "code": "C-1.3.2",
      "text": "भारतीय आहार ऋतू व प्रकृती यांचा संबंध जोडतो."
    },
    {
      "id": "c4_ev_12",
      "code": "C-1.3.3",
      "text": "विविध प्रकारच्या वनस्पती (वृक्ष, झुडूप, रोप, वेल) यांची वैशिष्ट्ये निरीक्षणातून सांगतो."
    },
    {
      "id": "c4_ev_13",
      "code": "C-1.3.4",
      "text": "पाने, फुले, बिया यांचा संग्रह करतो."
    },
    {
      "id": "c4_ev_14",
      "code": "C-1.3.5",
      "text": "परिसरातील कीटकांचे उपयोग सांगतो."
    },
    {
      "id": "c4_ev_15",
      "code": "C-1.3.6",
      "text": "अन्नसाखळी ही संकल्पना स्पष्ट करतो."
    },
    {
      "id": "c4_ev_16",
      "code": "C-1.3.8",
      "text": "वनस्पतीच्या मुळांचे प्रकार (सोटमुळ व तंतुमय मूळ) आणि त्यांचे कार्य सांगतो."
    },
    {
      "id": "c4_ev_17",
      "code": "C-1.3.9",
      "text": "दिवस व रात्र आणि पृथ्वीचे फिरणे यांचा सहसंबंध स्पष्ट करतो."
    },
    {
      "id": "c4_ev_18",
      "code": "C-1.3.10",
      "text": "चंद्रकला संकल्पना स्पष्ट करतो."
    },
    {
      "id": "c4_ev_19",
      "code": "C-1.3.11",
      "text": "आकाशात दिसणाऱ्या चंद्रच्या निरीक्षणातून बदलल्या आकाराचे चित्रे काढतो."
    },
    {
      "id": "c4_ev_20",
      "code": "C-1.3.12",
      "text": "कृष्ण पक्ष, शुक्ल पक्ष या काळात चंद्रच्या आकारात होणारा बदल सांगतो."
    },
    {
      "id": "c4_ev_21",
      "code": "C-1.5.1",
      "text": "स्थानिक संसाधनांचा वापर करून उपयुक्त/सजावटीच्या वस्तुंची निर्मिती करण्यासाठी आवश्यक हत्यारे सुरक्षितपणे वापरतो."
    },
    {
      "id": "c4_ev_22",
      "code": "C-2.1.1",
      "text": "पाण्याचे विविध स्त्रोत सांगून, त्यांच्या स्वच्छतेचे महत्व सांगतो."
    },
    {
      "id": "c4_ev_23",
      "code": "C-2.1.2",
      "text": "पाणी बचतीचे मार्ग सांगतो."
    },
    {
      "id": "c4_ev_24",
      "code": "C-2.1.3",
      "text": "पाण्याचे प्रदूषण संकल्पना स्पष्ट करतो."
    },
    {
      "id": "c4_ev_25",
      "code": "C-2.1.4",
      "text": "पाणी साठवण्याच्या पारंपरिक पद्धतीची माहिती मिळवून त्यांचे महत्व सांगतो."
    },
    {
      "id": "c4_ev_26",
      "code": "C-2.1.5",
      "text": "पाणी शुद्धीकरणाच्या पारंपरिक पद्धती सांगतो."
    },
    {
      "id": "c4_ev_27",
      "code": "C-2.1.6",
      "text": "शेतातून स्वयंपाक घरापर्यंत पोहोचताना धान्यावर होणाऱ्या विविध प्रक्रियांची यादी करतो."
    },
    {
      "id": "c4_ev_28",
      "code": "C-2.1.7",
      "text": "विविध प्रदेशातील लोकांचे अन्न आणि जीवनशैली यांच्यातील संबंध सांगतो."
    },
    {
      "id": "c4_ev_29",
      "code": "C-2.1.9",
      "text": "महाराष्ट्रातील विविध सणांमध्ये बनविल्या जाणाऱ्या अन्नपदार्थाची यादी करतो."
    },
    {
      "id": "c4_ev_30",
      "code": "C-2.1.10",
      "text": "अन्न, पाणी वाटप करताना समानतेची भावना राखतो."
    },
    {
      "id": "c4_ev_31",
      "code": "C-2.1.11",
      "text": "अन्न उत्पादनात शेतकऱ्याच्या भूमिकेचे महत्व विशद करतो."
    },
    {
      "id": "c4_ev_32",
      "code": "C-2.1.13",
      "text": "परसबागेत औषधी वनस्पतींची लागवड करून काळजी घेतो."
    },
    {
      "id": "c4_ev_33",
      "code": "C-2.1.15",
      "text": "राज्यातील प्रमुख नद्या व धरणाची नावे सांगतो."
    },
    {
      "id": "c4_ev_34",
      "code": "C-2.1.16",
      "text": "राज्यातील प्रमुख नद्या व धरणाची नावे नकाशामध्ये दाखवतो."
    },
    {
      "id": "c4_ev_35",
      "code": "C-2.1.19",
      "text": "मानवी आंतरेंद्रियांची नावे सांगतो."
    },
    {
      "id": "c4_ev_36",
      "code": "C-2.1.20",
      "text": "विजेचा वापर व बचतीचे महत्व सांगतो."
    },
    {
      "id": "c4_ev_37",
      "code": "C-2.1.21",
      "text": "भौगोलिक परिस्थिती व उपयोगानुसार वाहतुकीच्या साधनांची विविधिता स्पष्ट करतो."
    },
    {
      "id": "c4_ev_38",
      "code": "C-2.1.22",
      "text": "प्रवासाच्या साधनात कालानुरूप होत गेलेल्या बदलांचे समाजास झालेले फायदे सांगतो."
    },
    {
      "id": "c4_ev_39",
      "code": "C-2.1.23",
      "text": "वापरत असलेल्या संदेशवहनाच्या साधनांची माहिती सांगतो."
    },
    {
      "id": "c4_ev_40",
      "code": "C-2.2.1",
      "text": "विविध प्रादेशिक परंपरांशी जोडलेल्या वाद्यांच्या ऐतिहासिक व सांस्कृतिक परंपरांचा अभ्यास करतो."
    },
    {
      "id": "c4_ev_41",
      "code": "C-2.2.2",
      "text": "राज्यातील प्रमुख अन्न, पिके, सण आणि पदार्थ इत्यादींची माहिती मिळवतो."
    },
    {
      "id": "c4_ev_42",
      "code": "C-3.1.1",
      "text": "सुरक्षित व असुरक्षित स्पर्श यातील फरक ओळखतो."
    },
    {
      "id": "c4_ev_43",
      "code": "C-3.1.2",
      "text": "अनोळखी व्यक्तीसोबत व्यक्त होताना काळजी घेतो."
    },
    {
      "id": "c4_ev_44",
      "code": "C-3.1.3",
      "text": "परिसर स्वच्छ ठेवण्यासाठी पुढाकार घेतो."
    },
    {
      "id": "c4_ev_45",
      "code": "C-3.1.4",
      "text": "कचऱ्याचे वर्गीकरण करतो."
    },
    {
      "id": "c4_ev_46",
      "code": "C-3.1.6",
      "text": "कचऱ्याचा पुनर्वापर करण्याच्या पद्धतींची माहिती सांगतो."
    },
    {
      "id": "c4_ev_47",
      "code": "C-3.1.7",
      "text": "अन्न शिजवण्याच्या विविध पद्धती सांगतो."
    },
    {
      "id": "c4_ev_48",
      "code": "C-3.1.8",
      "text": "अन्न टिकवण्याच्या पारंपरिक पद्धती सांगतो."
    },
    {
      "id": "c4_ev_49",
      "code": "C-3.1.9",
      "text": "अन्न दूषित होण्याची कारणे सांगतो."
    },
    {
      "id": "c4_ev_50",
      "code": "C-3.1.10",
      "text": "अन्न पाणी निर्धोक करण्याच्या पद्धती स्पष्ट करतो."
    },
    {
      "id": "c4_ev_51",
      "code": "C-3.1.11",
      "text": "निर्धोक पाण्याचे महत्व इतरांना सांगतो."
    },
    {
      "id": "c4_ev_52",
      "code": "C-3.1.12",
      "text": "पाणी बचतीचे उपाय सांगतो."
    },
    {
      "id": "c4_ev_53",
      "code": "C-3.1.13",
      "text": "सभोवतालच्या संसाधनांचा अपव्यय टाळण्यासाठी मार्ग सुचवितो."
    },
    {
      "id": "c4_ev_54",
      "code": "C-3.1.14",
      "text": "पक्षी व प्राणी यांचे अन्न व निवारे सांगतो."
    },
    {
      "id": "c4_ev_55",
      "code": "C-3.1.15",
      "text": "उपलब्ध साहित्याच्या माध्यमातून पक्षी, प्राण्यांसाठी निवाऱ्यांची निर्मिती करतो."
    },
    {
      "id": "c4_ev_56",
      "code": "C-3.1.16",
      "text": "गाव व शहर येथील घरांच्या विविध प्रकारांचे वर्णन करतो."
    },
    {
      "id": "c4_ev_57",
      "code": "C-3.1.17",
      "text": "पर्यावरणपूरक घरांची माहिती मिळवतो."
    },
    {
      "id": "c4_ev_58",
      "code": "C-3.1.19",
      "text": "परिसरातील झाडे, प्राणी यांच्या प्रति संवेनदशीलता दाखवतो."
    },
    {
      "id": "c4_ev_59",
      "code": "C-3.2.1",
      "text": "विजेचा वापर करताना सुरक्षितता बाळगतो आणि इतरांनाही जागृत करतो."
    },
    {
      "id": "c4_ev_60",
      "code": "C-3.2.2",
      "text": "प्रवासादरम्यान घ्यावयाची काळजी सांगतो."
    },
    {
      "id": "c4_ev_61",
      "code": "C-3.2.3",
      "text": "नैसर्गिक आपत्तीच्या वेळेस सुरक्षिततेसंबंधी घ्याययाच्या काळजीबाबत चर्चा करतो."
    },
    {
      "id": "c4_ev_62",
      "code": "C-3.3.1",
      "text": "स्वच्छतेसंबंधी घोषवाक्य बनवून त्याचा अर्थ सांगतो."
    },
    {
      "id": "c4_ev_63",
      "code": "C-3.3.2",
      "text": "आपत्तीसंबंधी घोषवाक्ये व चिन्ह वापरून नाटिका सादर करतो."
    },
    {
      "id": "c4_ev_64",
      "code": "C-3.3.3",
      "text": "पर्यावरण संरक्षणासाठी व संवर्धनासाठी विविधि चित्रे / तक्ते / घोषवाक्य तयार करतो."
    },
    {
      "id": "c4_ev_65",
      "code": "C-4.1.1",
      "text": "विविध प्राणी आणि पक्ष्यांच्या अन्नसवयी ओळखून त्यांची परिसरातील / पर्यावरणातील भूमिका स्पष्ट करतो."
    },
    {
      "id": "c4_ev_66",
      "code": "C-4.1.2",
      "text": "फुलांचे व फळांचे वनस्पतीच्या प्रजननामधील महत्व सांगतो."
    },
    {
      "id": "c4_ev_67",
      "code": "C-4.1.3",
      "text": "वनस्पतींचे स्वयंपोषी, परपोषी, कीटकभक्षी असे वर्गीकरण करतो."
    },
    {
      "id": "c4_ev_68",
      "code": "C-4.1.4",
      "text": "प्राण्यांमधील प्रजननाचे प्रकार सांगून त्यानुसार वर्गीकरण करतो."
    },
    {
      "id": "c4_ev_69",
      "code": "C-4.1.5",
      "text": "परिसरातील प्राण्यांच्या सामूहिक वर्तनाचा निरीक्षणाद्वारे अर्थ लावतो."
    },
    {
      "id": "c4_ev_70",
      "code": "C-4.1.6",
      "text": "सूर्योदय व सूर्यास्ताच्या वेळी प्राणी आणि पक्ष्यांच्या वर्तनाचे निरीक्षण करतो."
    },
    {
      "id": "c4_ev_71",
      "code": "C-4.1.7",
      "text": "कीटकांच्या जीवनचक्रातील टप्पे सांगतो."
    },
    {
      "id": "c4_ev_72",
      "code": "C-4.2.1",
      "text": "राज्यातील वेगवेगळ्या परिसरातील मातीचे प्रकार सांगून त्यांचे नमुने गोळा करतो."
    },
    {
      "id": "c4_ev_73",
      "code": "C-4.3.1",
      "text": "आपल्या सभोवतालच्या परिसरातील मातीचे प्रकार सांगून त्यांचे नमुने गोळा करतो."
    },
    {
      "id": "c4_ev_74",
      "code": "C-4.3.2",
      "text": "परिसरातील मातीचे प्रकार ओळखतो."
    },
    {
      "id": "c4_ev_75",
      "code": "C-4.3.3",
      "text": "स्थानिक नैसर्गिक संसाधनाच्या दूषितीकरणाचे परिणाम सांगतो."
    },
    {
      "id": "c4_ev_76",
      "code": "C-4.3.4",
      "text": "शहरी व ग्रामीण भागांवरील घरांचा फरक स्पष्ट करतो."
    },
    {
      "id": "c4_ev_77",
      "code": "C-4.3.5",
      "text": "आपल्या सभोवतालच्या असलेल्या पक्षी व प्राण्यांच्या निवाऱ्यांची काळजी घेतो."
    },
    {
      "id": "c4_ev_78",
      "code": "C-4.3.6",
      "text": "पक्ष्यांसाठी व प्राण्यांसाठी नैसर्गिक संसाधनाचा वापर करून छोटेसे निवारे तयार करतो."
    },
    {
      "id": "c4_ev_79",
      "code": "C-4.3.7",
      "text": "घराच्या बांधकामासाठी वापरण्यात येणारे पारंपरिक व आधुनिक साहित्य ओळखून त्यांची यादी तयार करतो."
    },
    {
      "id": "c4_ev_80",
      "code": "C-4.4.1",
      "text": "परिसरातील वनस्पती संवर्धनाचे उपाय स्पष्ट करतो."
    },
    {
      "id": "c4_ev_81",
      "code": "C-4.4.2",
      "text": "पावसाच्या पाण्याचे संवर्धन करण्याच्या विविध पद्धतींची माहिती मिळवतो."
    },
    {
      "id": "c4_ev_82",
      "code": "C-4.4.3",
      "text": "मृदासंवर्धनाची गरज स्पष्ट करतो."
    },
    {
      "id": "c4_ev_83",
      "code": "C-4.5.1",
      "text": "प्राणी आणि पक्ष्यांच्या शरीराच्या रंगांचा त्यांच्या परिसराशी असलेला संबंध सांगतो."
    },
    {
      "id": "c4_ev_84",
      "code": "C-4.5.2",
      "text": "पाण्याचा पुनर्वापर करतो."
    },
    {
      "id": "c4_ev_85",
      "code": "C-4.5.3",
      "text": "पाणी बचतीची शपथ घेतो."
    },
    {
      "id": "c4_ev_86",
      "code": "C-4.5.4",
      "text": "पाणी पुनर्वापराचे फायदे सांगतो."
    },
    {
      "id": "c4_ev_87",
      "code": "C-4.7.1",
      "text": "शहरी व ग्रामीण भागातील सुविधांची माहिती सांगतो."
    },
    {
      "id": "c4_ev_88",
      "code": "C-5.1.1",
      "text": "चित्र, चिन्ह वापरून घर / शाळा / गावातील परिसराच्या सीमा नकाशात दर्शवतो."
    },
    {
      "id": "c4_ev_89",
      "code": "C-5.1.2",
      "text": "नकाशातील चिन्हे , खुणा यांचा अर्थ सांगतो."
    },
    {
      "id": "c4_ev_90",
      "code": "C-5.1.3",
      "text": "विविध चिन्हे व खुणा यांचा वापर करून गाव, शाळा, प्रभाग यांचा नकाशा तयार करतो."
    },
    {
      "id": "c4_ev_91",
      "code": "C-5.2.1",
      "text": "विविध चिन्हे व खुणा, सूची यांचा वापर करून गाव शाळा प्रभाग यांच्या नकाशाचे रेखाटन करतो."
    },
    {
      "id": "c4_ev_92",
      "code": "C-5.3.1",
      "text": "महाराष्ट्राच्या नकाशात जिल्हे, प्रशासकीय विभाग, राजधानी. राजधानी, उपराजधानी, महत्वाची शहरे यांचे स्थान दाखवतो."
    },
    {
      "id": "c4_ev_93",
      "code": "C-5.3.2",
      "text": "राज्यातील प्रमुख पिके, अन्नपदार्थ आणि सण ऐतिहासीक ठिकाणे, पर्यटन स्थळे, उद्योग, वाहतुकीचे मार्ग इत्यादींचे स्थान नकाशावर दाखवतो."
    },
    {
      "id": "c4_ev_94",
      "code": "C-6.1.1",
      "text": "विचारप्रवर्तक प्रश्नांवर स्वतःची मते व्यक्त करतो."
    },
    {
      "id": "c4_ev_95",
      "code": "C-6.1.2",
      "text": "गटात विचारप्रवर्तक प्रश्नांवर चर्चा करतो."
    },
    {
      "id": "c4_ev_96",
      "code": "C-6.1.3",
      "text": "मुक्तोत्तरी प्रश्नांची उत्तरे सांगतो/लिहितो."
    },
    {
      "id": "c4_ev_97",
      "code": "C-6.1.4",
      "text": "कोड्यांची उकल करण्यासाठी उत्तरांपर्यंत घेऊन जाणाऱ्या प्रश्नांची मांडणी करतो."
    },
    {
      "id": "c4_ev_98",
      "code": "C-6.1.5",
      "text": "समस्यांचे निराकरण करण्यासाठी प्रश्नांची रचना करतो."
    },
    {
      "id": "c4_ev_99",
      "code": "C-6.1.6",
      "text": "परिसरातील निरनिराळ्या घटना, वस्तू, प्रक्रिया यांच्याशी संबंधित प्रश्न विचारतो."
    },
    {
      "id": "c4_ev_100",
      "code": "C-6.1.7",
      "text": "निरीक्षण करुन प्रश्नांची उत्तरे शोधतो."
    },
    {
      "id": "c4_ev_101",
      "code": "C-6.2.1",
      "text": "परिसरातील सजीवांचे निरीक्षण करून चित्रे काढतो."
    },
    {
      "id": "c4_ev_102",
      "code": "C-6.2.2",
      "text": "विविध संकल्पनांवर आधारित चित्र, आकृती काढतो."
    },
    {
      "id": "c4_ev_103",
      "code": "C-6.2.3",
      "text": "विविध संकल्पनांचे चित्र, आकृतीच्या आधारे सादरीकरण करतो."
    },
    {
      "id": "c4_ev_104",
      "code": "C-6.2.4",
      "text": "नाटक, खेळ, कवितांच्या आधारे विविध संकल्पनाचे सादरीकरण करतो."
    },
    {
      "id": "c4_ev_105",
      "code": "C-6.2.5",
      "text": "विविध संकल्पना संवाद, मौखिक अथवा लेखी माध्यमातून सादर करतो."
    },
    {
      "id": "c4_ev_106",
      "code": "C-6.2.6",
      "text": "विविध कृतीचे निरीक्षण व निष्कर्षाचे सादरीकरण विविध माध्यमाद्वारे करतो."
    },
    {
      "id": "c4_ev_107",
      "code": "C-7.1.1",
      "text": "ऊर्जा संकल्पना स्पष्ट करतो."
    },
    {
      "id": "c4_ev_108",
      "code": "C-7.1.2",
      "text": "ऊर्जा रूपे सांगतो. (सौर ऊर्जा, पवन ऊर्जा)"
    },
    {
      "id": "c4_ev_109",
      "code": "C-7.1.3",
      "text": "दैनंदिन जीवनातील यंत्रे ओळखतो."
    },
    {
      "id": "c4_ev_110",
      "code": "C-7.1.4",
      "text": "दैनंदिन जीवनातील विजेवर चालणारी उपकरणे ओळखतो."
    },
    {
      "id": "c4_ev_111",
      "code": "C-7.2.1",
      "text": "दैनंदिन जीवनातील चुंबकाची उदाहरणे सांगतो."
    },
    {
      "id": "c4_ev_112",
      "code": "C-7.2.2",
      "text": "प्रकाशाचे संक्रमण ओळखतो."
    },
    {
      "id": "c4_ev_113",
      "code": "C-7.2.3",
      "text": "छाया निर्मितीची प्रक्रिया दर्शविण्यासाठी प्रयोग सादर करतो."
    },
    {
      "id": "c4_ev_114",
      "code": "C-7.2.4",
      "text": "पदार्थावर होणारा उष्णतेचा परिणाम सांगतो."
    }
  ],
  "evs2": [
    {
      "id": "c4_ev_1",
      "code": "C-1.5.1",
      "text": "छत्रपती शिवाजी महाराजांच्या घराण्याची वंशावळ स्पष्ट करतो."
    },
    {
      "id": "c4_ev_2",
      "code": "C-2.3.1",
      "text": "शिवकालीन दळणवळणाची साधने, संसाधने यांची माहिती व महत्व स्पष्ट करतो."
    },
    {
      "id": "c4_ev_3",
      "code": "C-2.3.2",
      "text": "स्वराज्य निर्मितीसाठी छत्रपती शिवाजी महाराजांनी वापर केलेल्या संसाधनांची माहिती सांगतो."
    },
    {
      "id": "c4_ev_4",
      "code": "C-2.3.3",
      "text": "शिवराज्याभिषेक सोहळ्याचे वर्णन करतो."
    },
    {
      "id": "c4_ev_5",
      "code": "C-4.2.1",
      "text": "शिवकालीन खेळ आणि वेशभूषा यांची माहिती सांगतो."
    },
    {
      "id": "c4_ev_6",
      "code": "C-4.2.2",
      "text": "शिवकालीन खेळांची नावे, प्रकार व वैशिष्ट्ये यांची माहिती सांगतो."
    },
    {
      "id": "c4_ev_7",
      "code": "C-4.6.1",
      "text": "लोककल्याणकारी राज्यासाठी छत्रपती शिवाजी महाराजांनी अष्टप्रधान मंडळाची केलेली रचना व कार्ये तसेच रयतेच्या हितासाठी कार्यरत स्वराज्यातील प्रशासन व्यवस्था सांगतो."
    },
    {
      "id": "c4_ev_8",
      "code": "C-6.1.1",
      "text": "छत्रपती शिवाजी महाराजांच्या काळातील गडकोट आणि आरमार यावर आधारित माहिती संकलित करून विविध प्रश्नांद्वारे चौकशी करतो."
    },
    {
      "id": "c4_ev_9",
      "code": "C-6.2.1",
      "text": "छत्रपती शिवाजी महाराजांच्या व्यक्तिमत्वामधील विविध स्फूर्तिदायी घटना सांगतो."
    },
    {
      "id": "c4_ev_10",
      "code": "C-8.1.1",
      "text": "शिवकालीन लोकजीवन समजून घेऊन कालानुरूप होत गेलेले सांस्कृतिक व सामाजिक बदल सांगून शिवकालीन लोकजीवनाची तुलना आधुनिक लोकजीवनाशी करतो."
    },
    {
      "id": "c4_ev_11",
      "code": "C-8.2.1",
      "text": "शिवकाळातील दुर्ग, स्थापत्यकला, मुर्तिकला, शिल्पकला, धातुकाम यांची माहिती घेऊन कालानुरूप झालेले बदल अभ्यासतो आणि स्पष्ट करतो."
    },
    {
      "id": "c4_ev_12",
      "code": "C-9.1.1",
      "text": "छत्रपती शिवाजी महाराज यांचे स्वराज्य उभारणीतील महत्व व जीवन कार्य, स्फूर्तिदायक प्रसंग, घटना यांच्या माध्यमातून सांगतो व विश्लेषण करतो."
    },
    {
      "id": "c4_ev_13",
      "code": "C-9.2.1",
      "text": "शिवरायांच्या जीवनातील विविध प्रसंगातून चातुर्य, धैर्य आणि विवेक यांचा वापर करून जीवनातील समस्येवर मात करतो."
    },
    {
      "id": "c4_ev_14",
      "code": "C-9.4.1",
      "text": "शिवजन्मपूर्व व शिवकालीन संतांची कामगिरी स्पष्ट करतो."
    },
    {
      "id": "c4_ev_15",
      "code": "C-9.5.1",
      "text": "छत्रपती शिवरायांच्या जीवनातील प्रेरक प्रसंग, घटना, युद्धनीती, चातुर्य यांसारख्या गुणवैशिष्ट्यांची माहिती सांगतो."
    },
    {
      "id": "c4_ev_16",
      "code": "C-9.6.1",
      "text": "स्वराज्य स्थापनेत योगदान देणारे शूर सरदार आणि कर्तृत्ववान महिला यांच्या जीवनातील प्रेरक प्रसंग शौर्यगाथा कथन करतो."
    },
    {
      "id": "c4_ev_17",
      "code": "C-10.3.1",
      "text": "छत्रपती शिवाजी महाराजांनी अवलंबलेले पर्यावरण धोरण विशद करतो."
    }
  ]
};

export const CLASS_4_SEMI_OUTCOMES: Record<string, OutcomeItem[]> = {
  ...CLASS_4_OUTCOMES,
  math: [
    { id: "c4_semi_mt1", code: "04.71.01", text: "applies operations on numbers in daily life." },
    { id: "c4_semi_mt2", code: "04.71.02", text: "classifies the numbers as even or odd." },
    { id: "c4_semi_mt3", code: "04.71.03", text: "multiplies 2 and 3-digit numbers." },
    { id: "c4_semi_mt4", code: "04.71.04", text: "divides a number by another number using different methods like - pictorially (by drawing dots), equal grouping or repeated subtraction and by using inter-relationship between division and multiplication." },
    { id: "c4_semi_mt5", code: "04.71.05", text: "creates and solves simple real life situations/problems including coins, notes, length, mass and capacity by using the four operations." },
    { id: "c4_semi_mt6", code: "04.71.06", text: "works with fractions: identifies half, one-fourth, three-fourths of a whole in a given picture by paper folding and also in a collection of objects; represents the fractions as half (1/2), one-fourth (1/4) and three-fourths (3/4) by using numbers/numerals; shows the equivalence of a fraction (1/2) and (2/4) with other fractions." },
    { id: "c4_semi_mt7", code: "04.71.07", text: "acquires understanding about shapes around her/him." },
    { id: "c4_semi_mt8", code: "04.71.08", text: "identifies the centre, radius and diameter of the circle." },
    { id: "c4_semi_mt9", code: "04.71.09", text: "finds out shapes that can be used for tiling." },
    { id: "c4_semi_mt10", code: "04.71.10", text: "makes cube/cuboids using the given nets." },
    { id: "c4_semi_mt11", code: "04.71.11", text: "draws top view, front view and side view of simple objects." },
    { id: "c4_semi_mt12", code: "04.71.12", text: "explores the area and perimeter of simple geometrical shapes (triangle, rectangle, square) in terms of given shape as a unit. For example, the number of books that can completely fill the top of a table." },
    { id: "c4_semi_mt13", code: "04.71.13", text: "converts metre into centimetre and centimetre into metre." },
    { id: "c4_semi_mt14", code: "04.71.14", text: "estimates the length of an object/distance between two locations, weight of various objects, volume of liquid, etc., and verifies them by actual measurement." },
    { id: "c4_semi_mt15", code: "04.71.15", text: "solves problem involving daily life situations related to length, distance, weight, volume and time involving four basic arithmetic operations." },
    { id: "c4_semi_mt16", code: "04.71.16", text: "reads clock time in hour and minutes and expresses the time in a.m. and p.m." },
    { id: "c4_semi_mt17", code: "04.71.17", text: "relates to 24 hr clock with respect to 12 hr clock." },
    { id: "c4_semi_mt18", code: "04.71.18", text: "calculates time intervals / duration of familiar daily life events by using forward or backward counting / addition and subtraction." },
    { id: "c4_semi_mt19", code: "04.71.19", text: "identifies the pattern in multiplication and division. (up to multiple of 9)" },
    { id: "c4_semi_mt20", code: "04.71.20", text: "represents the collected information in tables and bar graphs and draws inferences from these." },
  ],
};
